# ꦲꦶꦏꦶꦱꦶꦱ꧀ꦠꦼꦩ꧀ꦏꦁꦒꦺꦴꦒꦫꦥ꧀ꦒꦮꦺꦪꦤ꧀
# ꦲꦗꦢꦶꦧꦸꦱꦏ꧀

import re
def ꦥꦢꦺꦴꦱ꧀(ꦲꦸꦏꦫ,ꦔꦉꦥ꧀,ꦧꦸꦫꦶ):
    try:
        ꦫꦺꦒꦺꦏ꧀ = rf'{ꦔꦉꦥ꧀}(.*?){ꦧꦸꦫꦶ}'
        return re.findall(ꦫꦺꦒꦺꦏ꧀,ꦲꦸꦏꦫ)
    except:
        return 1

def ꦥꦿꦶꦤ꧀(*ꦥ꦳ꦫꦶꦪꦧꦼꦭ꧀, ꦊꦠ꧀='',ꦧꦂ='\n',ꦥ꦳ꦲꦶꦭ꧀=None):
    ꦲꦸꦩ꧀ꦣꦶꦏ꧀ = {"0": "꧐", "1": "꧑", "2": "꧒", "3": "꧓", "4": "꧔", "5": "꧕", "6": "꧖", "7": "꧗", "8": "꧘", "9": "꧙"}
    
    ꦄꦁꦏ = ꦥꦢꦺꦴꦱ꧀(ꦥ꦳ꦫꦶꦪꦧꦼꦭ꧀,"꧇","꧇")
    if len(ꦄꦁꦏ) > 0:
        for ꦄ in ꦄꦁꦏ:
            ꦕꦕꦃ = ""
            for ꦥ꦳ꦂ in ꦄ:
                ꦥ꦳ꦂ = str(ꦥ꦳ꦂ)
                for ꦤꦸꦩ꧀ in ꦲꦸꦩ꧀ꦣꦶꦏ꧀.keys():
                    if ꦤꦸꦩ꧀ in ꦥ꦳ꦂ:
                        ꦥ꦳ꦂ = ꦥ꦳ꦂ.replace(ꦤꦸꦩ꧀, ꦲꦸꦩ꧀ꦣꦶꦏ꧀[ꦤꦸꦩ꧀])
                ꦕꦕꦃ += ꦥ꦳ꦂ
            ꦥ꦳ꦫꦶꦪꦧꦼꦭ꧀ = ꦥ꦳ꦫꦶꦪꦧꦼꦭ꧀.replace(f"꧇{ꦄ}꧇", ꦕꦕꦃ)

    ꦥꦼꦱꦼꦤ꧀ = ""
    for ꦥ꦳ꦂ in ꦥ꦳ꦫꦶꦪꦧꦼꦭ꧀:
        ꦥ꦳ꦂ = str(ꦥ꦳ꦂ)        
        for ꦤꦸꦩ꧀ in ꦲꦸꦩ꧀ꦣꦶꦏ꧀.keys():
            if ꦤꦸꦩ꧀ in ꦥ꦳ꦂ:
                ꦥ꦳ꦂ = ꦥ꦳ꦂ.replace(ꦤꦸꦩ꧀, ꦲꦸꦩ꧀ꦣꦶꦏ꧀[ꦤꦸꦩ꧀])
        ꦥꦼꦱꦼꦤ꧀ += ꦥ꦳ꦂ + ꦊꦠ꧀
    print(ꦥꦼꦱꦼꦤ꧀, sep=ꦊꦠ꧀, end=ꦧꦂ, file=ꦥ꦳ꦲꦶꦭ꧀)

# ꦏꦺꦴꦣꦼꦩꦸꦤꦁꦏꦺꦤꦺ

